"""Напиши модуль utils.py и продемонстрируй разные способы импорта. Создай файл utils.py с двумя-тремя полезными
    функциями (например, проверка чётности, преобразование строки в число с обработкой ошибки). Затем в двух разных
    файлах-заготовках подключи его: в первом — import utils, во втором — from utils import ... as .... Обрати внимание
    на разницу в вызове."""

import utils

if __name__ == "__main__":
    print(utils.str_to_int("10"))
    utils.str_to_int("ss")
    print(utils.is_parity(10))
    print(utils.is_parity(11))