"""Мини-блок «рейтинг фильма». Считайте рейтинг (число с плавающей точкой через float()) и с помощью тернарного
   оператора присвойте переменной verdict строку «рекомендуем» при рейтинге ≥ 7, иначе — «пропустить».
   Выведите verdict. Объясните комментарием, почему здесь логично использовать тернарный оператор."""

try:
    rating = float(input("Введите рейтинг: "))
    # Тернарный оператор: Используются только 2 значения при выборе
    verdict = "рекомендуем" if rating >= 7 else "пропустить"

    print(f"При рейтинге {rating} {verdict}")
except ValueError:
    print("Неверное значение рейтинга.")