"""Мини-блок «рейтинг фильма». Считайте рейтинг (число с плавающей точкой через float()) и с помощью тернарного
   оператора присвойте переменной verdict строку «рекомендуем» при рейтинге ≥ 7, иначе — «пропустить».
   Выведите verdict. Объясните комментарием, почему здесь логично использовать тернарный оператор."""
UNKNOWN = -1

try:
    rating = float(input("Введите рейтинг: "))

    if rating < 0:
        raise ValueError
except ValueError:
    rating = UNKNOWN

if rating != UNKNOWN:
    # Тернарный оператор: При выполнения условия используются только 2 значения
    verdict = "рекомендуем" if rating >= 7 else "пропустить"

    print(f"При рейтинге {rating} {verdict}")
else:
    print("Неверное значение рейтинга.")

