"""Звёздочка (сложные условия и короткое замыкание). Напишите программу проверки данных пользователя (логин, пароль,
   возраст, email). Используя and/or/not, проверьте несколько требований и выведите понятное сообщение об ошибке для
   каждого случая (пустой логин, слишком короткий пароль, возраст меньше 18, невалидный email). Объясните в комментариях,
   где сработало короткое замыкание и почему это полезно (например, не выполнять лишнюю проверку, если логин уже
   невалиден)."""

login: str = "test"
password: str = "aaaaaaaa"
email: str = "qq@qq.ru"
age = 18

if login is not None and login.strip():
    if password is not None and (len(password.strip()) >= 8):
        # Упрощаю проверку валидности емайл по @ и .
        is_email_failed = (email is None or
            (email.strip() and ('@' not in email or '.' not in email)))

        print(f"Email {"невалиден" if is_email_failed else "валиден"}")

        if age < 18:
            print("Доступ запрещен, тк возраст менее 18 лет")
        else:
            print("Все ОК. Доступ разрешен")
    else:
        print("Пустой пароль, либо короткий (менее 8 символов).")
else:
    print("Логин невалиден.")





