"""
Звёздочка (продвинутая). Самостоятельно изучите csv.DictReader и csv.DictWriter по официальной документации Python.
Напишите программу, которая читает blog.csv с помощью DictReader и выводит список книг с фильтром (например, только те,
где просмотры > 100). Либо — изучите, как читать большой файл построчно через for line in f: вместо readlines(), и
напишите программу, которая считает количество строк в большом лог-файле, не загружая его целиком в память. Сравните
два подхода и объясните, почему построчный выигрышен для больших файлов.
"""

import csv

# выводит список книг с фильтром (например, только те, где просмотры > 100)
with open("blog.csv", "r", encoding="utf-8", newline="") as f:
    reader = csv.DictReader(f)

    for row in reader:
        if int(row["views"]) > 100:
            print(row)

# считает количество строк в большом файле, загружая ее полностью в память
with open("blog.csv", "r", encoding="utf-8") as f:
    f.readline() # Чтобы не выводить заголовок
    print("\n1. Количество строк:", len(f.readlines()))

# считает количество строк в большом файле, загружая ее построчно в память, выгружая предыдущие строки
with open("blog.csv", "r", encoding="utf-8") as f:
    f.readline()  # Чтобы не выводить заголовок
    print("2. Количество строк:", sum(1 for line in f))