"""Разбей программу на модули и добавь точку входа. Возьми любую небольшую программу из прошлых занятий (например,
    «калькулятор» или «список дел») и разложи её на модули: один файл — логика/данные, второй — интерфейс (ввод/вывод),
    третий — точка входа main.py с if __name__ == "__main__":. Запусти через uv run python main.py"""

import ui, data

if __name__ == '__main__':
    number1 = ui.input_data("Введите первое число: ")
    number2 = ui.input_data("Введите второе число: ")

    if (number1 or number2) is not None:
        ui.output_data("Результат вычисления:", data.calculate(number1, number2))
    else:
        print("Не удалось вычислить")
