"""Калькулятор характера числа. Напишите программу, которая просит ввести целое число и сообщает:
   оно чётное или нечётное, положительное, отрицательное или ноль, и больше ли оно 100.
   Используйте if/elif/else и оператор остатка %."""

try:
    note = ""
    number = int(input("Введите целое число: "))

    if number < 0:
        note = "отрицательное"
    elif 0 == number:
        note = "ноль"
    else:
        note = "положительное"

    note += " и больше 100" if number > 100 else ""
    note += ", четное" if 0 == number % 2 else ", нечетное"

    print(f"Данное число: {note}")
except ValueError:
    print("Введенное значение не является числом.")