"""Автомат по возрасту. Программа считывает возраст и через if/elif/else относит человека к категории: 0–12 — ребёнок,
13–17 — подросток, 18–64 — взрослый, 65+ — пенсионер. Добавьте проверку на некорректный ввод (возраст < 0 или > 150)
через elif и сообщите об ошибке."""

try:
    note = ""
    person_age = int(input("Введите возраст: "))

    if (person_age < 0) or (person_age > 150):
        raise ValueError

    if 0 <= person_age <= 12:
        note = "ребенок"
    elif 13 <= person_age <= 17:
        note = "подросток"
    elif 18 <= person_age <= 64:
        note = "взрослый"
    else:
        note = "пенсионер"

    print(f"Человек с возрастом {person_age} - {note}")
except ValueError:
    print("Неверно введен возраст, либо вне допустимого диапазона.")