"""Факты о себе как кортеж. Создать кортеж person из имени, возраста и города. Вывести его тип, длину, элемент по
    индексу и срез. Отдельно продемонстрировать, почему (5) — не кортеж, а (5,) — кортеж. Попробовать изменить элемент
    и перехватить TypeError."""

person = ("Илья", 48, "Москва")

print("Тип:", type(person))
print("Длина:", len(person))
print("Первый элемент:", person[0])
print("Срез:", person[:2])

print("(5) = ", type((5)))
print("(5,) = ", type((5,)))

try:
    person[1] = 35
except TypeError:
    print("Нельзя менять данные кортежа")