"""Звёздочка — обмен значений. Продемонстрировать обмен значений двух переменных (a, b = b, a) и объяснить
    комментарием, почему это работает без временной переменной. Затем показать, что то же самое «схвачено» кортежем в
    виде a, b = (b, a) и что при этом происходит справа (какой объект создаётся). Напишите пояснение в 2–3 предложения."""

a = 10
b = 15

a, b = b, a # Здесь работает принцип можественного присваивания

print(f"a = {a}, b = {b}")

a, b = (b, a) # Здесь работает принцип упаковки во временный кортеж и последующая распаковка данных в переменные слева

print(f"a = {a}, b = {b}")