"""Звёздочка ★ — else в циклах. Самостоятельно изучите блок else в циклах (в официальной документации или в разделе 4 выше).
   Напишите программу, которая ищет заданное число в списке: если нашла — выводит «Нашли» и break, а если не нашла ни
   одного совпадения — выводит «Не нашли» через else у цикла. Объясните комментарием, почему else выполнился (или не
   выполнился)."""

import random

list = random.sample(range(1, 101),20) # Создаем список из 20 случайных чисел
number = random.randint(1, 101) # Случаное целое число

print(list)
print(f"Число для поиска: {number}")

for item in list:
    if item == number:
        print("Нашли")
        break
else: # Выполнится, если дошли до конца списка и в теле цикла не вызван break
    print("Не нашли")

