"""Оценки по порогам. Дан список оценок, например [95, 88, 60, 42, 100]. Пройтись по нему for-циклом и вывести для
   каждой оценки вердикт: >= 90 — «отлично», >= 70 — «хорошо», >= 50 — «удовлетворительно», иначе — «неудовлетворительно».
   Использовать if/elif/else внутри цикла."""

str_ = ""
list = [95, 88, 60, 42, 100]

for item in list:
    if item >= 90:
        str_ = "Отлично"
    elif item >= 70:
        str_ = "Хорошо"
    elif item >= 50:
        str_ = "Удовлетворительно"
    else:
        str_ = "Неудовлетворительно"
        
    print(f"Результат: {item}, оценка: {str_}")