"""1. Словарь «профиль». Создайте словарь с данными пользователя (имя, возраст, город, профессия). Затем:
    выведите значение по ключу и через get() с запасным значением; проверьте через in, есть ли в словаре ключ "phone";
    добавьте ключ "email" и измените значение "age"; удалите один ключ через pop и выведите получившийся словарь."""

profile = {
    "name": "Иван",
    "age": 25,
    "city": "Москва",
    "prof": "Программист"
}

print("Город:", profile["city"])
print("Фамилия:", profile.get("family", "Неизвестно"))
print("Наличие ключа \"phone\":", "phone" in profile)

profile["email"] = "ivan@example.com"
profile["age"] = 26

print("Новый словарь:", profile)

profile.pop("prof", "не задан")
print("Обновленный словарь:", profile)