"""2. Агрегация «баллы за курс». Дан словарь scores с баллами по курсам (не менее 4 курсов). Напишите цикл по items(),
    который: выведет каждую пару в формате курс: балл; посчитает сумму баллов; через get() выведет значение для курса,
    которого в словаре нет, с запасным текстом."""

scores = {
    "курс 1": 90,
    "курс 3": 75,
    "курс 5": 60,
    "курс 2": 40,
    "курс 6": 100
}

for course, score in scores.items():
    print(f"{course}: {score}")

print("\nСумма баллов по всем курсам:", sum(scores.values()))
print(f"\nкурс 7: {scores.get("курс 7", "Нет данных")}")