"""Фильтрация строк через comprehension. Заведите список из 8–10 строк (например, названий категорий блога).
   Через list comprehension: а) отфильтруйте строки длиннее 5 символов; б) постройте список из длин всех строк (len);
   в) постройте список строк с первой буквой в верхнем регистре (capitalize()). Выведите каждый результат."""

input_list = ["личный",
              "информационно-аналитический",
              "новостной",
              "партнёрский",
              "профессиональный",
              "музыкальный",
              "мониторинговый",
              "цитатный",
              "контентный"]

output_list1 = [item for item in input_list if len(item) > 10] # поставил условие - длиннее 10 символов
output_list2 = [len(item) for item in input_list]
output_list3 = [item.capitalize() for item in input_list]

print("Строки, длиннее 10 символов:", output_list1)
print("Список длин строк:", output_list2)
print("Строки, с первой буквой в верхнем регистре:", output_list3)