"""Звёздочка (самостоятельное изучение str.format()). Изучите по официальной документации Python метод str.format()
   (позиционные {} и именованные {name} поля, указание формата). Сравните его с f-строкой: напишите одну и ту же строку
   сначала через f-строку, затем через .format(), и зафиксируйте комментарием в коде преимущества и недостатки каждого
   способа (например: f-строки — короче и читабельнее, но не парсятся как данные; .format() — можно хранить шаблон в
   переменной и подставлять позже). Приведите по 2–3 примера."""

# Навскидку, format() удобен для шаблонов при постановке данных из внешних источников

template = "Пользователь системы: {}"

print(template.format("Илья"))
print(template.format("Алексей"))

# Но в format() можно ошибиться при заполнении, если переменных много

n = 5
print()

# Опасный вариант через format()
for i in range(1, 6):
    print("{} * {} = {}".format(i, n, i * n)) # ruff ругается на такую строку
print()

# безопасный вариант format(), но плохо читаемый
for i in range(1, 6):
    print("{i} * {n} = {i_n}".format(i = i, n = n, i_n = i * n)) # ruff ругается на такую строку
print()

# Через f-строку яснее и проще
for i in range(1, 6):
    print(f"{i} * {n} = {i * n}")
