"""Палиндром. Проверить, является ли строка палиндромом (читается одинаково с обеих сторон, игнорируя регистр и
   пробелы/знаки). Подсказка: убрать пробелы и знаки препинания, привести к нижнему регистру, сравнить строку с её
   переворотом s[::-1]. Примеры: "А роза упала на лапу Азора" → True; "Привет" → False."""

input_str = "Аргентина манит негра!"

str_ = "".join(input_str.split()).lower()

for char in [',', '.', '-', '!', '?']:
    str_ = str_.replace(char, '')

print(f"Строка \"{input_str}\" {"" if str_ == str_[::-1] else "не "}является палиндромом")

