"""Красивый заголовок. На вход подаётся «грязный» заголовок с лишними пробелами, кавычками и знаками препинания.
   «Почистить» его: убрать краевые пробелы (strip), схлопнуть повторные пробелы (split + join), снять фигурные
   скобки/кавычки (replace) и перевести каждое слово с заглавной буквы (capitalize в цикле). Вывести аккуратный
   заголовок."""

str_ = input("Введите строку: ").strip()

if str_:
    for char in "\"{}()": # Можно дополнить при необхродимости
        str_ = str_.replace(char, ' ')

    words = str_.split()

    for i in range(len(words)):
        words[i] = words[i].capitalize()

    print(f"Результат: {' '.join(words)}")
else:
    print("Строка не введена.")

# Комментарий к логике кода: ИМХО надо сначала чистить от скобок и кавычек (заменяя на пробелы)
# Только потом уже разделять на слова и сливать в новую строку, ибо может быть такой вариант "текст"текст{текст}текст"